In [ ]:
**missing values analysis**
- MVA very important in Data Analysis
- it is quiet natural data set has missing values
- there rae so many techniques are there
  - mean
  - median
  - mode
  - bfill
  - ffill
  - pad
  - random values
  - you can compare column values and

In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1={'Names':['ramu','manu','uma'],
      'Ages':[30,25,28],
      'city':['hyd','benguluru','chennai']}
d1=pd.DataFrame(dict1)
d1

  Names  Ages       city
0  ramu    30        hyd
1  manu    25  benguluru
2   uma    28    chennai

In [4]:
d1.isnull()

   Names   Ages   city
0  False  False  False
1  False  False  False
2  False  False  False

In [6]:
dict1={'Names':['ramu','manu','uma',np.nan],
      'Ages':[30,25,np.nan,28],
      'city':[np.nan,'hyd','benguluru','chennai']}
d1=pd.DataFrame(dict1)
d1

  Names  Ages       city
0  ramu  30.0        NaN
1  manu  25.0        hyd
2   uma   NaN  benguluru
3   NaN  28.0    chennai

In [7]:
d1.isnull()

   Names   Ages   city
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [5]:
d1.to_csv('d1.csv')

$method-1$
**random fill**

In [8]:
d1

  Names  Ages       city
0  ramu  30.0        NaN
1  manu  25.0        hyd
2   uma   NaN  benguluru
3   NaN  28.0    chennai

In [9]:
d1.fillna(40,inplace=True)
d1

  Names  Ages       city
0  ramu  30.0         40
1  manu  25.0        hyd
2   uma  40.0  benguluru
3    40  28.0    chennai

In [10]:
d1.dtypes

Names     object
Ages     float64
city      object
dtype: object

**method-2 **
- $fill the random values basedon column$

In [11]:
dict1={'Names':['ramu','manu','uma',np.nan],
      'Ages':[30,25,np.nan,28],
      'city':[np.nan,'hyd','benguluru','chennai']}
d1=pd.DataFrame(dict1)
d1

  Names  Ages       city
0  ramu  30.0        NaN
1  manu  25.0        hyd
2   uma   NaN  benguluru
3   NaN  28.0    chennai

In [12]:
d1['Ages'].fillna(40,inplace=True)
d1

  Names  Ages       city
0  ramu  30.0        NaN
1  manu  25.0        hyd
2   uma  40.0  benguluru
3   NaN  28.0    chennai

$method-3$
**apply mean - median - mode**

In [8]:
dict1={'Names':['ramu','manu','uma',np.nan],
      'Ages':[30,25,np.nan,28],
      'city':[np.nan,'hyd','benguluru','chennai']}
d1=pd.DataFrame(dict1)
d1

  Names  Ages       city
0  ramu  30.0        NaN
1  manu  25.0        hyd
2   uma   NaN  benguluru
3   NaN  28.0    chennai

In [12]:
age_mean=d1['Ages'].mean()
age_mean
d1['Ages'].fillna(age_mean,inplace=True)
d1

  Names       Ages       city
0  ramu  30.000000        NaN
1  manu  25.000000        hyd
2   uma  27.666667  benguluru
3   NaN  28.000000    chennai

In [13]:
age_median=d1['Ages'].median()
age_median
d1['Ages'].fillna(age_median,inplace=True)
d1

  Names       Ages       city
0  ramu  30.000000        NaN
1  manu  25.000000        hyd
2   uma  27.666667  benguluru
3   NaN  28.000000    chennai

In [16]:
age_mode=d1['Ages'].mode()
age_mode
d1['Ages'].fillna(age_mode,inplace=True)
d1

  Names       Ages       city
0  ramu  30.000000        NaN
1  manu  25.000000        hyd
2   uma  27.666667  benguluru
3   NaN  28.000000    chennai

$method-4$
- pad
- bfill
- fill
- backfill

In [17]:
dict1={'Names':['ramu','manu','uma',np.nan],
      'Ages':[30,25,np.nan,28],
      'city':[np.nan,'hyd','benguluru','chennai']}
d1=pd.DataFrame(dict1)
d1

  Names  Ages       city
0  ramu  30.0        NaN
1  manu  25.0        hyd
2   uma   NaN  benguluru
3   NaN  28.0    chennai

In [13]:
d1.fillna(method='pad')

  Names  Ages       city
0  ramu  30.0        NaN
1  manu  25.0        hyd
2   uma  40.0  benguluru
3   uma  28.0    chennai

In [14]:
d1.fillna(method='pad',axis=1)

  Names  Ages       city
0  ramu  30.0       30.0
1  manu  25.0        hyd
2   uma  40.0  benguluru
3   NaN  28.0    chennai

In [15]:
print("------pad------")
print(d1.fillna(method='pad'))
print('-----bfill')
print(d1.fillna(method='bfill'))
print('-----ffill--------')
print(d1.fillna(method='ffill'))
print('------backfill----')
print(d1.fillna(method='backfill'))

------pad------
  Names  Ages       city
0  ramu  30.0        NaN
1  manu  25.0        hyd
2   uma  40.0  benguluru
3   uma  28.0    chennai
-----bfill
  Names  Ages       city
0  ramu  30.0        hyd
1  manu  25.0        hyd
2   uma  40.0  benguluru
3   NaN  28.0    chennai
-----ffill--------
  Names  Ages       city
0  ramu  30.0        NaN
1  manu  25.0        hyd
2   uma  40.0  benguluru
3   uma  28.0    chennai
------backfill----
  Names  Ages       city
0  ramu  30.0        hyd
1  manu  25.0        hyd
2   uma  40.0  benguluru
3   NaN  28.0    chennai

In [23]:
d1.bfill(method='pad',axis=0)

TypeError: DataFrame.bfill() got an unexpected keyword argument 'method'

AttributeError: 'DataFrame' object has no attribute 'bfillna'

In [ ]:
$method-5$
**KNN imputer**
-KNN Stands k nearest neighbours
- it is one of ml odel to find the nearest solutions based on distance matrics
- instead of taking all the values of mean
-

In [16]:
d1['Ages'].values

array([30., 25., 40., 28.])

In [17]:
d1.values

array([['ramu', 30.0, nan],
       ['manu', 25.0, 'hyd'],
       ['uma', 40.0, 'benguluru'],
       [nan, 28.0, 'chennai']], dtype=object)